Revit 2024 API
Control Class
A control in Autodesk Revit family document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Control : Element
Visual Basic
Public Class Control _
	Inherits Element
Visual C++
public ref class Control : public Element
Remarks
 The object represents a variety of different shapes of controls in family document. The different shapes of controls can handle the family instance in different ways.
A vertical/horizontal arrow control rotates the instance by 180 degrees.
A double vertical arrow control mirrors the instance geometry vertically.
A double horizontal arrow control mirrors the instance geometry horizontally.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Control
See Also
Control Members
Autodesk.Revit.DB Namespace